import os

# ===== مسار الأساس =====
BASE = os.path.dirname(os.path.abspath(__file__))
DATA = os.path.join(BASE, "data")
UPLOADS = os.path.join(BASE, "uploads")

# ===== إنشاء المجلدات =====
for d in [DATA, UPLOADS]:
    os.makedirs(d, exist_ok=True)

# ===== أسماء ملفات Excel =====
EXCEL = {
    "requests": "الطلبات.xlsx",
    "items": "تفاصيل_الطلبات.xlsx",
    "attachments": "المرفقات.xlsx",
    "warehouse": "المستودع.xlsx",
    "custody": "العهد.xlsx",
    "approvals": "الاعتمادات.xlsx",
    "purchase": "سجل_الشراء.xlsx",
    "logs": "سجل_الحركات.xlsx",
    "users": "المستخدمين.xlsx",
    "it_reports": "تقارير_IT.xlsx",

}



# ===== الأعمدة الأساسية =====
COLUMNS = {
    "requests":[
        "رقم_الطلب","الدور","الرافع","القسم","الشركة","الفرع","النوع","الحالة","الوصف"
    ],
    "items":[
        "رقم_الطلب","كود","اسم","كمية","ملاحظات"
    ],
    "warehouse":[
        "كود","اسم","فئة","كمية_حالياً","حد_إعادة_الطلب","الموقع","الحالة"
    ],

    "custody":[
    "رقم_العهدة",
    "رقم_الطلب",
    "كود_الصنف",
    "اسم_الصنف",
    "نوع_العهدة",
    "سيريال",
    "الموظف",
    "القسم",
    "الفرع",
    "الكمية",
    "تاريخ_التسليم",
    "تاريخ_الاسترجاع",
    "الحالة",
    "ملاحظات",
    "الجهاز"
],

    "approvals":[
        "رقم_الطلب","الجهة","المعتمد","التاريخ","الوقت","ملاحظات"
    ],
    "purchase":[
        "رقم_الطلب","المورد","السعر","الفاتورة","تاريخ_الفاتورة","الحالة"
    ],
    "logs":[
        "رقم_الطلب","الحدث","منفذ","الدور","التاريخ","الوقت","ملاحظات"
    ],
    "users":[
    "اسم_المستخدم",
    "كلمة_المرور",
    "الدور",
    "القسم",
    "الشركة",
    "الفرع"
    ],

"attachments":[
    "رقم_الطلب",
    "اسم_الملف",
    "رافع",
    "دور",
    "القسم",
    "الشركة",
    "الفرع",
    "تاريخ",
    "وقت"
],

"it_reports": [
    "رقم_الطلب",
    "نوع_التقييم",
    "التوصية",
    "الوصف_الفني",
    "اسم_الفني",
    "تاريخ",
    "وقت",
    "مرفق"
],



}
